[
  {
    "type": "ECC",
    "name": "Elaine Chen",
    "nameConcatenated": "ElaineChen",
    "position": "Chair",
    "email": "chair@maasu.org",
    "positionRole": "The role of the chair is to provide vision to each member of the ECC by supporting the established vision of MAASU. They maintain regular communication with the Executive Director and Directors Council, and review and create future plans in order to provide and maintain ongoing goals for MAASU.",
    "personalGoal": "To find a balance between doing things for me and doing things for others - to be more intentional about what actions I take",
    "favoriteSong": "\"Sour Patch Kids\" by Bryce Vine or \"Tough\" by Quinn XCII",
    "favoriteMeme": "Why there no snack pokemon meme"
  },
  {
    "type": "ECC",
    "name": "Jordan Peyton",
    "nameConcatenated": "JordanPeyton",
    "position": "Secretary",
    "email": "ecc@maasu.org",
    "positionRole": "The role of the secretary is to document all MAASU meetings with the ECC and any other general assembly, assisting with the maintenance and record of files. They compile APIA-related resources for member schools and organizations to utilize, working with other chairs when applicable.",
    "personalGoal": "Figure out what to do post graduation",
    "favoriteSong": "\"Art Museum\" by Young the Giant",
    "favoriteMeme": "Pikachu with sad eyes"
  },
  {
    "type": "ECC",
    "name": "Kristie Lam",
    "nameConcatenated": "KristieLam",
    "position": "Advocacy",
    "email": "advocacy@maasu.org",
    "positionRole": "The role of the advocacy chair is to keep abreast of issues and organize mobilization on advocacy and education. They regularly update members of current issues that may affect students across the regions, as well as search for opportunities to develop coalitions with other marginalized communities and organizations.",
    "personalGoal": "This year, my personal goal is to raise the political awareness and civic engagement among Midwestern APIDA students.",
    "favoriteSong": "The entire SweetSexySavage album by Kehlani",
    "favoriteMeme": "The spongebob mocking meme"
  },
  {
    "type": "ECC",
    "name": "Nhu Nguyen",
    "nameConcatenated": "NhuNguyen",
    "position": "Advocacy",
    "email": "advocacy@maasu.org",
    "positionRole": "The role of the advocacy chair is to keep abreast of issues and organize mobilization on advocacy and education. They regularly update members of current issues that may affect students across the regions, as well as search for opportunities to develop coalitions with other marginalized communities and organizations.",
    "personalGoal": "",
    "favoriteSong": "",
    "favoriteMeme": ""
  },
  {
    "type": "ECC",
    "name": "Michael Daehyun Jobson",
    "nameConcatenated": "MichaelJobson",
    "position": "Communications",
    "email": "communications@maasu.org",
    "positionRole": "The communications chair is the liaison between ECC and M-Reps and distribute information to M-Reps on a timely basis. They promote interaction among M-reps, including M-Rep meetings and conference calls. Additionally, they oversee member school conference stipends process by creating application forms, promoting to member schools, and coordinating the selection process.",
    "personalGoal": "",
    "favoriteSong": "",
    "favoriteMeme": ""
  },
  {
    "type": "ECC",
    "name": "Annie Le",
    "nameConcatenated": "AnnieLe",
    "position": "Membership Outreach",
    "email": "memoutreach@maasu.org",
    "positionRole": "The membership outreach chair established relations with new schools, communicating MAASU’s mission and the benefits of becoming a member school. They research history of involvement of member and potential schools.",
    "personalGoal": "To be able to do a handstand, travel more, and learn a new dance",
    "favoriteSong": "\"Smile\" by Charlie Chaplin (Glee cover)",
    "favoriteMeme": "Jants meme"
  },
  {
    "type": "ECC",
    "name": "Katt Lee",
    "nameConcatenated": "KattLee",
    "position": "Programming",
    "email": "programming@maasu.org",
    "positionRole": "The programming chair establishes programs in line with MAASU’s vision and mission to provide unity across campuses. They draft program proposals to be distributed to member schools to aid in their understanding of the program and their involvement.",
    "personalGoal": "To be able to enjoy free time before adulthood hits",
    "favoriteSong": "https://youtu.be/ZZ5LpwO-An4",
    "favoriteMeme": "Savage patrick"
  },
  {
    "type": "ECC",
    "name": "Jenny Vu",
    "nameConcatenated": "JennyVu",
    "position": "Programming",
    "email": "programming@maasu.org",
    "positionRole": "The programming chair establishes programs in line with MAASU’s vision and mission to provide unity across campuses. They draft program proposals to be distributed to member schools to aid in their understanding of the program and their involvement.",
    "personalGoal": "To become a better leader and to become more confident and sure in myself",
    "favoriteSong": "\"Coaster\" by Khalid",
    "favoriteMeme": "The meme where the woman is yelling at a white cat"
  },
  {
    "type": "ECC",
    "name": "Alice Yu",
    "nameConcatenated": "AliceYu",
    "position": "Public Relations",
    "email": "pr@maasu.org",
    "positionRole": "The role of the public relations chair produces press releases, press packets, and marketing packages for all MAASU-sponsored events and provide these materials to member schools. They create regular newsletters and multimedia content to be distributed on all forms of media. They design medium to highlight members in the member school community.",
    "personalGoal": "I'm working toward finding pockets of spaces in Edinburgh that I can confidently call home, and also planning for more travels around the world!",
    "favoriteSong": "\"Who Lives, Who Dies, Who Tells Your Story\" from Hamilton: The Musical",
    "favoriteMeme": "The vine where the little girl pours a bit of apple juice, and then pours the whole bottle and then the person video taping just screams"
  },
  {
    "type": "ECC",
    "name": "Sam Bossley",
    "nameConcatenated": "SamBossley",
    "position": "Technical Networking",
    "email": "technet@maasu.org",
    "positionRole": "The role of the technical networking chair is to update website content regularly and maintain archives of files. They aid host schools in hosting their conference website if necessary or aid in forwarding capabilities.",
    "personalGoal": "I hope to read more classic literature and sci-fi novels",
    "favoriteSong": "\"Let's Go Picnic\" by George",
    "favoriteMeme": "Joker getting hit by a car"
  },
  {
    "type": "ED",
    "name": "Victoria Yu",
    "nameConcatenated": "VictoriaYu",
    "position": "Executive Director",
    "email": "execdirector@maasu.org",
    "positionRole": "The executive director serves as the liaison between the ECC, Directors Council, and the Board of Advisors. They build relationships and organizational partnerships with national and regional APIA organizations, and manage the MAASU financial budgets and accounts, including filing proper fiscal paperwork necessary for nonprofit status.",
    "personalGoal": "Continuing to challenge myself by engaging in new experiences and opportunities",
    "favoriteSong": "\"A Little Happiness\" by Hebe Tian",
    "favoriteMeme": "When you're falling asleep but someone mentions food"
  },
  {
    "type": "DC",
    "name": "James Liu",
    "nameConcatenated": "JamesLiu",
    "position": "Director of Alumni Relations",
    "email": "directorscouncil@maasu.org",
    "positionRole": "The director of alumni relations focuses on building and connecting with alumni and manages the MAASU Alumni Association. They oversee the MAASU Alumni Association and its mission to continue building and sustaining lifelong relationships between MAASU and it alumni. They additionally provide alumni opportunities to reconnect with MAASU through programming, conferences, and other avenues for engagement.",
    "personalGoal": "To help establish a stronger foundation for the MAASU Alumni Association (MAA)",
    "favoriteSong": "\"So Far Away\" by Martin Garrix",
    "favoriteMeme": "The iPhone Pro Max boba meme"
  },
  {
    "type": "DC",
    "name": "Jessica Lee",
    "nameConcatenated": "JessicaLee",
    "position": "Director of Finance and Partnerships",
    "email": "directorscouncil@maasu.org",
    "positionRole": "The director of finance and partnerships oversees all finances pertaining to conferences. They are in charge of helping students properly do their paperwork, review sponsorships, and assist with fundraising efforts. They develop annual financial plans and projections, and establish and manage external affairs and partnerships.",
    "personalGoal": "Working towards clean eating and making my body stronger!",
    "favoriteSong": "\"Dreamer\" by Axwell and Ingrosso",
    "favoriteMeme": "The spongebob mocking meme"
  },
  {
    "type": "DC",
    "name": "David Lee",
    "nameConcatenated": "DavidLee",
    "position": "Director of Programs and Assessments",
    "email": "directorscouncil@maasu.org",
    "positionRole": "The director of programs and assessments focuses on developing curriculum and assessing student programs and events. They oversee workshops and programs for conferences, and create assessment and compile a report for all MAASU programs.",
    "personalGoal": "To decide on what I'd like to do next year and whether or not I'd like to take a gap year before continuing onto more grad school",
    "favoriteSong": "\"Show Goes On\" by Lupe Fiasco",
    "favoriteMeme": "Monkey puppet looking away meme"
  },
  {
    "type": "BOA",
    "name": "Linda Luk",
    "nameConcatenated": "LindaLuk",
    "position": "President",
    "email": "linda.luk@gmail.com",
    "positionRole": "The role of the board of advisors is to provide oversight of MAASU and advise the Executive Director and ECC Chair. They establish and maintain professional and appropriate boundaries and relationships with students.",
    "personalGoal": "",
    "favoriteSong": "",
    "favoriteMeme": ""
  },
  {
    "type": "BOA",
    "name": "Cleda Wang",
    "nameConcatenated": "CledaWang",
    "position": "Treasurer",
    "email": "cleda.wang@housing.wisc.edu",
    "positionRole": "The role of the board of advisors is to provide oversight of MAASU and advise the Executive Director and ECC Chair. They establish and maintain professional and appropriate boundaries and relationships with students.",
    "personalGoal": "",
    "favoriteSong": "",
    "favoriteMeme": ""
  }
]